icofoam-cases/lid-driven-cavity-Re=5000/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

Re              5000;
nu              0.01;
L               1.0;

U0              #calc "$Re * $nu / $L"; 

internalField   uniform ($U0 0 0);


boundaryField
{
    movingWall
    {
        type    fixedValue;
        value   uniform ($U0 0 0);
    }

    otherWalls
    {
        type    noSlip;
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
